<?php
/*
* Plugin Name: [Youngreads] Голосование за регионы
* Description: Управление и вывод результатов голосования за регионы
* Version: 0.1
* Author: A. Belov
*/

if (!defined('WPINC')) die();

add_action('init', function () {
    // создаем тип материала и настраиваем кастомные поля
    include_once('classes/yr-vote-type.php');

    // инициализируем административный раздел плагина
    require_once('classes/yr-vote-admin.php');

    // вывод таблицы с созданными городами
    require_once ('classes/yr-vote-admin-table.php');

    require_once ('classes/yr-vote-front.php');
});

define('template_path', plugin_dir_path(__FILE__) . 'templates/');
define('script_path', plugins_url() . '/youngreads-vote/js/');
define('style_path', plugins_url() . '/youngreads-vote/css/');

function add_regions()
{
    $regions = [
        'Алтайский край',
        'Амурская область',
        'Архангельская область',
        'Астраханская область',
        'Белгородская область',
        'Брянская область',
        'Владимирская область',
        'Волгоградская область',
        'Вологодская область',
        'Воронежская область',
        'Москва',
        'Еврейская автономная область',
        'Забайкальский край',
        'Ивановская область',
        'Иркутская область',
        'Кабардино-Балкарская Республика',
        'Калининградская область',
        'Калужская область',
        'Камчатский край',
        'Карачаево-Черкесская Республика',
        'Кемеровская область',
        'Кировская область',
        'Костромская область',
        'Краснодарский край',
        'Красноярский край',
        'Курганская область',
        'Курская область',
        'Ленинградская область',
        'Липецкая область',
        'Магаданская область',
        'Московская область',
        'Мурманская область',
        'Ненецкий автономный округ',
        'Нижегородская область',
        'Новгородская область',
        'Новосибирская область',
        'Омская область',
        'Оренбургская область',
        'Орловская область',
        'Пензенская область',
        'Пермский край',
        'Приморский край',
        'Псковская область',
        'Республика Адыгея',
        'Республика Алтай',
        'Республика Башкортостан',
        'Республика Бурятия',
        'Республика Дагестан',
        'Республика Ингушетия',
        'Республика Калмыкия',
        'Республика Карелия',
        'Республика Коми',
        'Республика Крым',
        'Республика Марий Эл',
        'Республика Мордовия',
        'Республика Саха',
        'Республика Северная Осетия — Алания',
        'Республика Татарстан',
        'Республика Тыва',
        'Республика Хакасия',
        'Ростовская область',
        'Рязанская область',
        'Самарская область',
        'Санкт-Петербург',
        'Саратовская область',
        'Сахалинская область',
        'Свердловская область',
        'Севастополь',
        'Смоленская область',
        'Ставропольский край',
        'Тамбовская область',
        'Тверская область',
        'Томская область',
        'Тульская область',
        'Тюменская область',
        'Удмуртская Республика',
        'Ульяновская область',
        'Хабаровский край',
        'Ханты-Мансийский автономный округ — Югра',
        'Челябинская область',
        'Чеченская Республика',
        'Чувашская Республика',
        'Чукотский автономный округ',
        'Ямало-Ненецкий автономный округ',
        'Ярославская область'
    ];
    $user_id = get_current_user_id();
    foreach ($regions as $region) {
        $fields = [
            'post_type' => 'city',
            'post_title' => $region,
            'post_status' => 'publish',
            'post_author' => $user_id
        ];

        $post_id = wp_insert_post($fields);

        add_post_meta($post_id, 'vote', 0);
    }
}

register_activation_hook(__FILE__, 'add_regions');

function remove_regions()
{
    $params = array(
        'posts_per_page' => -1,
        'post_type'	=> 'city'
    );
    $q = new WP_Query( $params );
    if( $q->have_posts() ) :
        while( $q->have_posts() ) : $q->the_post();
            wp_delete_post( $q->post->ID, true );
        endwhile;
    endif;
    wp_reset_postdata();
}

register_deactivation_hook( __FILE__, 'remove_regions' );
